# django
# pillow

# django-admin - утилита для запуска команд django

# создание проекта
# django-admin startproject <project_name> - создаст отдельную папку для проекта
# django-admin startproject <project_name> . - не создаст отдельную папку для проекта
#
# переходим в папку проекта 
# cd project_name

# создание приложения внутри проекта 
# python manage.py startapp app_name

# запуск локального сервера
# хост по умолчанию (127.0.0.1:8000)
# python manage.py runserver 4561


# API - application program interface

# инциализация гита в проект
# git init - инциализирует пустой гит репозиторий в папке проекта
# git status - провереяет добавляемые папки\файлы в репозиторий
# git add <название_файла>\. - добавляет все измененные или новые файли и папки для просмотра
# git commit -m "комментарий" - комментарий для изменных файлов
# git branch -M main - создали главную ветку ( делается 1 раз )
# git push -u origin main - отправляем изменения на репозиторий
# настройка профиля отправляющего изменения в репозиторий

# git config user. name '' - указываем юзернейм аккаунта  который отправляет данные 
# git config user. name '' - указываем почту аккаунта  который отправляет данные 

# .gitignore - файл в котором описывается то, что мы игнорируем 